Revit 2026 API

# FabricationConfigurationUnloadItemFiles Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UnloadItemFiles(
	IList<FabricationItemFile> itemFiles
)
```
```vb
Public Sub UnloadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
)
```
```cpp
public:
void UnloadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
```
```fsharp
member UnloadItemFiles :
        itemFiles : IList<FabricationItemFile> -> unit
```

#### Parameters

itemFiles IListFabricationItemFile

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace